ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_CFG_SLV_48026000h.xml
<module name="ICSSM_PR1_CFG_SLV" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_PR1_CFG_SLV_PID_REG" acronym="ICSSM_PR1_CFG_SLV_PID_REG" offset="0" width="32" description="">
		<bitfield id="ICSS_IDVER" width="32" begin="31" end="0" resetval="0x1795686915" description="Module ID field" range="31:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_CFG_SLV_HWDIS_REG" acronym="ICSSM_PR1_CFG_SLV_HWDIS_REG" offset="4" width="32" description="">
		<bitfield id="HWDIS" width="8" begin="7" end="0" resetval="0x0" description="HW Disable Observation" range="7:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_CFG_SLV_GPCFG0_REG" acronym="ICSSM_PR1_CFG_SLV_GPCFG0_REG" offset="8" width="32" description="">
		<bitfield id="PR1_PRU0_GP_MUX_SEL" width="4" begin="29" end="26" resetval="0x0" description="" range="29:26" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_SH1_SEL" width="1" begin="25" end="25" resetval="0x0" description="" range="25" rwaccess="R"/>
	<bitfield id="PRU0_GPO_DIV1" width="5" begin="24" end="20" resetval="0x0" description="" range="24:20" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_DIV0" width="5" begin="19" end="15" resetval="0x0" description="" range="19:15" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_MODE" width="1" begin="14" end="14" resetval="0x0" description="" range="14" rwaccess="R/W"/>
	<bitfield id="PRU0_GPI_SB" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R/W1TC"/>
	<bitfield id="PRU0_GPI_DIV1" width="5" begin="12" end="8" resetval="0x0" description="" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRU0_GPI_DIV0" width="5" begin="7" end="3" resetval="0x0" description="" range="7:3" rwaccess="R/W"/>
	<bitfield id="PRU0_GPI_CLK_MODE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_GPI_MODE" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_GPCFG1_REG" acronym="ICSSM_PR1_CFG_SLV_GPCFG1_REG" offset="12" width="32" description="">
		<bitfield id="PR1_PRU1_GP_MUX_SEL" width="4" begin="29" end="26" resetval="0x0" description="" range="29:26" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_SH1_SEL" width="1" begin="25" end="25" resetval="0x0" description="" range="25" rwaccess="R"/>
	<bitfield id="PRU1_GPO_DIV1" width="5" begin="24" end="20" resetval="0x0" description="" range="24:20" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_DIV0" width="5" begin="19" end="15" resetval="0x0" description="" range="19:15" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_MODE" width="1" begin="14" end="14" resetval="0x0" description="" range="14" rwaccess="R/W"/>
	<bitfield id="PRU1_GPI_SB" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R/W1TC"/>
	<bitfield id="PRU1_GPI_DIV1" width="5" begin="12" end="8" resetval="0x0" description="" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRU1_GPI_DIV0" width="5" begin="7" end="3" resetval="0x0" description="" range="7:3" rwaccess="R/W"/>
	<bitfield id="PRU1_GPI_CLK_MODE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_GPI_MODE" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_CGR_REG" acronym="ICSSM_PR1_CFG_SLV_CGR_REG" offset="16" width="32" description="">
		<bitfield id="ICSS_STOP_ACK" width="1" begin="31" end="31" resetval="0x1" description="" range="31" rwaccess="R/W"/>
	<bitfield id="ICSS_STOP_REQ" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R"/>
	<bitfield id="ICSS_PWR_IDLE" width="1" begin="29" end="29" resetval="0x1" description="" range="29" rwaccess="R/W"/>
	<bitfield id="BOTTOM_HALF_CLK_GATE_EN" width="1" begin="21" end="21" resetval="0x1" description="" range="21" rwaccess="R/W"/>
	<bitfield id="TOP_HALF_CLK_GATE_EN" width="1" begin="20" end="20" resetval="0x1" description="" range="20" rwaccess="R/W"/>
	<bitfield id="AUTO_SLICE1_CLK_GATE_EN" width="1" begin="19" end="19" resetval="0x0" description="" range="19" rwaccess="R/W"/>
	<bitfield id="AUTO_SLICE0_CLK_GATE_EN" width="1" begin="18" end="18" resetval="0x0" description="" range="18" rwaccess="R/W"/>
	<bitfield id="IEP_CLK_EN" width="1" begin="17" end="17" resetval="0x1" description="" range="17" rwaccess="R/W"/>
	<bitfield id="IEP_CLK_STOP_ACK" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/>
	<bitfield id="IEP_CLK_STOP_REQ" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/>
	<bitfield id="ECAP_CLK_EN" width="1" begin="14" end="14" resetval="0x1" description="" range="14" rwaccess="R/W"/>
	<bitfield id="ECAP_CLK_STOP_ACK" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R"/>
	<bitfield id="ECAP_CLK_STOP_REQ" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/>
	<bitfield id="UART_CLK_EN" width="1" begin="11" end="11" resetval="0x1" description="" range="11" rwaccess="R/W"/>
	<bitfield id="UART_CLK_STOP_ACK" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R"/>
	<bitfield id="UART_CLK_STOP_REQ" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="INTC_CLK_EN" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R/W"/>
	<bitfield id="INTC_CLK_STOP_ACK" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/>
	<bitfield id="INTC_CLK_STOP_REQ" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_GPECFG0_REG" acronym="ICSSM_PR1_CFG_SLV_GPECFG0_REG" offset="20" width="32" description="">
		<bitfield id="PRU0_GPO_SHIFT_CLK_DONE" width="1" begin="17" end="17" resetval="0x0" description="" range="17" rwaccess="R/W1C"/>
	<bitfield id="PRU0_GPO_SHIFT_CLK_HIGH" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_SHIFT_CNT" width="8" begin="15" end="8" resetval="0x0" description="" range="15:8" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_SHIFT_GP_EN" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_SHIFT_CLK_FREE" width="1" begin="5" end="5" resetval="0x1" description="" range="5" rwaccess="R/W"/>
	<bitfield id="PRU0_GPO_SHIFT_SWAP" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="PRU0_GPI_SHIFT_EN" width="1" begin="1" end="1" resetval="0x1" description="" range="1" rwaccess="R/W"/>
	<bitfield id="PRU0_GPI_SB_P" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_GPECFG1_REG" acronym="ICSSM_PR1_CFG_SLV_GPECFG1_REG" offset="24" width="32" description="">
		<bitfield id="PRU1_GPO_SHIFT_CLK_DONE" width="1" begin="17" end="17" resetval="0x0" description="" range="17" rwaccess="R/W1C"/>
	<bitfield id="PRU1_GPO_SHIFT_CLK_HIGH" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_SHIFT_CNT" width="8" begin="15" end="8" resetval="0x0" description="" range="15:8" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_SHIFT_GP_EN" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_SHIFT_CLK_FREE" width="1" begin="5" end="5" resetval="0x1" description="" range="5" rwaccess="R/W"/>
	<bitfield id="PRU1_GPO_SHIFT_SWAP" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="PRU1_GPI_SHIFT_EN" width="1" begin="1" end="1" resetval="0x1" description="" range="1" rwaccess="R/W"/>
	<bitfield id="PRU1_GPI_SB_P" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_RESET_ISO_REG" acronym="ICSSM_PR1_CFG_SLV_RESET_ISO_REG" offset="28" width="32" description="">
		<bitfield id="RESET_ISO_EDGE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="W"/>
	<bitfield id="RESET_ISO_ACK" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="W"/>
	<bitfield id="RESET_ISO_REQ" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W1C"/>
	</register><register id="ICSSM_PR1_CFG_SLV_MII_RT_REG" acronym="ICSSM_PR1_CFG_SLV_MII_RT_REG" offset="44" width="32" description="">
		<bitfield id="MII_RT_EVENT_EN" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_IEPCLK_REG" acronym="ICSSM_PR1_CFG_SLV_IEPCLK_REG" offset="48" width="32" description="">
		<bitfield id="IEP1_SLV_EN" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/>
	<bitfield id="IEP_OCP_CLK_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_SPP_REG" acronym="ICSSM_PR1_CFG_SLV_SPP_REG" offset="52" width="32" description="">
		<bitfield id="RTU_XFR_SHIFT_EN" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/>
	<bitfield id="XFR_BYTE_SHIFT_EN" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="XFR_SHIFT_EN" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/>
	<bitfield id="PRU1_PAD_HP_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_SPIN_CFG_REG" acronym="ICSSM_PR1_CFG_SLV_SPIN_CFG_REG" offset="56" width="32" description="">
		<bitfield id="SPIN_CLOCK_TX_PRU_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_CORE_SYNC_REG" acronym="ICSSM_PR1_CFG_SLV_CORE_SYNC_REG" offset="60" width="32" description="">
		<bitfield id="CORE_VBUSP_SYNC_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_SA_MX_REG" acronym="ICSSM_PR1_CFG_SLV_SA_MX_REG" offset="64" width="32" description="">
		<bitfield id="PWM_EFC_EN" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/>
	<bitfield id="PWM3_REMAP_EN" width="2" begin="11" end="10" resetval="0x0" description="" range="11:10" rwaccess="R/W"/>
	<bitfield id="PWM0_REMAP_EN" width="2" begin="9" end="8" resetval="0x0" description="" range="9:8" rwaccess="R/W"/>
	<bitfield id="SA_MUX_SEL" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_DIV_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_DIV_REG" offset="68" width="32" description="">
		<bitfield id="PRU0_SD_MAN_REC_CLK_PERIOD" width="8" begin="31" end="24" resetval="0x0" description="" range="31:24" rwaccess="R"/>
	<bitfield id="PRU0_SD_MAN_CLK_CAL_DONE" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/>
	<bitfield id="PRU0_SD_MAN_STATUS" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R"/>
	<bitfield id="PRU0_SD_CH_SEL" width="4" begin="14" end="11" resetval="0x0" description="" range="14:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_MAN_NV_DATA_EN" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_MAN_EN" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SHARE_EN" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG0" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG0" offset="72" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL0" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL0" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG0" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG0" offset="76" width="32" description="">
		<bitfield id="PRU0_FD_EN_0" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_0" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE0" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG1" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG1" offset="80" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL1" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL1" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG1" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG1" offset="84" width="32" description="">
		<bitfield id="PRU0_FD_EN_1" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_1" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE1" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG2" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG2" offset="88" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL2" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV2" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL2" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG2" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG2" offset="92" width="32" description="">
		<bitfield id="PRU0_FD_EN_2" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_2" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE2" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG3" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG3" offset="96" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL3" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV3" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL3" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG3" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG3" offset="100" width="32" description="">
		<bitfield id="PRU0_FD_EN_3" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_3" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE3" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG4" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG4" offset="104" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL4" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV4" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL4" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG4" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG4" offset="108" width="32" description="">
		<bitfield id="PRU0_FD_EN_4" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_4" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE4" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG5" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG5" offset="112" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL5" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV5" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL5" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG5" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG5" offset="116" width="32" description="">
		<bitfield id="PRU0_FD_EN_5" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
