ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_CFG_SLV_48026000h.xml
	<bitfield id="PRU0_FD_WINDOW_SIZE_5" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE5" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG6" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG6" offset="120" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL6" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV6" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL6" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG6" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG6" offset="124" width="32" description="">
		<bitfield id="PRU0_FD_EN_6" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_6" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE6" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG7" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG7" offset="128" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_7" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_7" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_7" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_7" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL7" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV7" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL7" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG7" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG7" offset="132" width="32" description="">
		<bitfield id="PRU0_FD_EN_7" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_7" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_7" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_7" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_7" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_7" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE7" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG8" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_CLK_SEL_REG8" offset="136" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_8" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_8" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ZERO_MIN_8" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_8" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_ACC_SEL8" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_INV8" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_CLK_SEL8" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG8" acronym="ICSSM_PR1_CFG_SLV_PRU0_SD_SAMPLE_SIZE_REG8" offset="140" width="32" description="">
		<bitfield id="PRU0_FD_EN_8" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MAX_8" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MAX_LIMIT_8" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_ONE_MIN_8" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU0_FD_ONE_MIN_LIMIT_8" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_FD_WINDOW_SIZE_8" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU0_SD_SAMPLE_SIZE8" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_DIV_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_DIV_REG" offset="144" width="32" description="">
		<bitfield id="PRU1_SD_MAN_REC_CLK_PERIOD" width="8" begin="31" end="24" resetval="0x0" description="" range="31:24" rwaccess="R"/>
	<bitfield id="PRU1_SD_MAN_CLK_CAL_DONE" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/>
	<bitfield id="PRU1_SD_MAN_STATUS" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R"/>
	<bitfield id="PRU1_SD_CH_SEL" width="4" begin="14" end="11" resetval="0x0" description="" range="14:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_MAN_NV_DATA_EN" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_MAN_EN" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SHARE_EN" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG0" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG0" offset="148" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL0" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL0" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG0" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG0" offset="152" width="32" description="">
		<bitfield id="PRU1_FD_EN_0" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_0" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE0" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG1" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG1" offset="156" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL1" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL1" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG1" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG1" offset="160" width="32" description="">
		<bitfield id="PRU1_FD_EN_1" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_1" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE1" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG2" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG2" offset="164" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL2" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV2" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL2" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG2" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG2" offset="168" width="32" description="">
		<bitfield id="PRU1_FD_EN_2" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_2" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE2" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG3" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG3" offset="172" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL3" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV3" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL3" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG3" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG3" offset="176" width="32" description="">
		<bitfield id="PRU1_FD_EN_3" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_3" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE3" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG4" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG4" offset="180" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL4" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV4" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL4" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG4" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG4" offset="184" width="32" description="">
		<bitfield id="PRU1_FD_EN_4" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_4" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE4" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG5" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG5" offset="188" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL5" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV5" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL5" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG5" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG5" offset="192" width="32" description="">
		<bitfield id="PRU1_FD_EN_5" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_5" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE5" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG6" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG6" offset="196" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL6" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV6" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL6" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG6" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG6" offset="200" width="32" description="">
		<bitfield id="PRU1_FD_EN_6" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_6" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE6" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG7" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG7" offset="204" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_7" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_7" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_7" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_7" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL7" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV7" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL7" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG7" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG7" offset="208" width="32" description="">
		<bitfield id="PRU1_FD_EN_7" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_7" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_7" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_7" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_7" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_7" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
