ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_CFG_SLV_48026000h.xml
	<bitfield id="PRU1_SD_SAMPLE_SIZE7" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG8" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_CLK_SEL_REG8" offset="212" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_8" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_8" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ZERO_MIN_8" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_8" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_ACC_SEL8" width="2" begin="5" end="4" resetval="0x0" description="" range="5:4" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_INV8" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_CLK_SEL8" width="2" begin="1" end="0" resetval="0x0" description="" range="1:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG8" acronym="ICSSM_PR1_CFG_SLV_PRU1_SD_SAMPLE_SIZE_REG8" offset="216" width="32" description="">
		<bitfield id="PRU1_FD_EN_8" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MAX_8" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MAX_LIMIT_8" width="5" begin="21" end="17" resetval="0x0" description="" range="21:17" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_ONE_MIN_8" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/>
	<bitfield id="PRU1_FD_ONE_MIN_LIMIT_8" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_FD_WINDOW_SIZE_8" width="3" begin="10" end="8" resetval="0x0" description="" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRU1_SD_SAMPLE_SIZE8" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_RX_CFG_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_RX_CFG_REG" offset="224" width="32" description="">
		<bitfield id="PRU0_ED_RX_DIV_FACTOR" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_DIV_FACTOR_FRAC" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_CLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_SB_POL" width="1" begin="3" end="3" resetval="0x1" description="" range="3" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_SAMPLE_SIZE" width="3" begin="2" end="0" resetval="0x7" description="" range="2:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_TX_CFG_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_TX_CFG_REG" offset="228" width="32" description="">
		<bitfield id="PRU0_ED_TX_DIV_FACTOR" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_DIV_FACTOR_FRAC" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/>
	<bitfield id="PRU0_ENDAT_SHARE_EN" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/>
	<bitfield id="PRU0_ENDAT2_CLK_SYNC" width="1" begin="10" end="10" resetval="0x1" description="" range="10" rwaccess="R"/>
	<bitfield id="PRU0_ENDAT1_CLK_SYNC" width="1" begin="9" end="9" resetval="0x1" description="" range="9" rwaccess="R"/>
	<bitfield id="PRU0_ENDAT0_CLK_SYNC" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R"/>
	<bitfield id="PRU0_ED_BUSY_2" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/>
	<bitfield id="PRU0_ED_BUSY_1" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/>
	<bitfield id="PRU0_ED_BUSY_0" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R"/>
	<bitfield id="PRU0_ED_TX_CLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_CH0_CFG0_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_CH0_CFG0_REG" offset="232" width="32" description="">
		<bitfield id="PRU0_ED_TX_FIFO_SWAP_BITS0" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_SW_CLK_OUT0" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_CLK_OUT_OVR_EN0" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_SNOOP0" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/>
	<bitfield id="PRU0_ED_RX_FRAME_SIZE0" width="12" begin="27" end="16" resetval="0x0" description="" range="27:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_FRAME_SIZE0" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_WDLY0" width="11" begin="10" end="0" resetval="0x0" description="" range="10:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_CH0_CFG1_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_CH0_CFG1_REG" offset="236" width="32" description="">
		<bitfield id="PRU0_ED_RX_EN_COUNTER0" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TST_DELAY_COUNTER0" width="16" begin="15" end="0" resetval="0x0" description="" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_CH1_CFG0_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_CH1_CFG0_REG" offset="240" width="32" description="">
		<bitfield id="PRU0_ED_TX_FIFO_SWAP_BITS1" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_SW_CLK_OUT1" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_CLK_OUT_OVR_EN1" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_SNOOP1" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/>
	<bitfield id="PRU0_ED_RX_FRAME_SIZE1" width="12" begin="27" end="16" resetval="0x0" description="" range="27:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_FRAME_SIZE1" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_WDLY1" width="11" begin="10" end="0" resetval="0x0" description="" range="10:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_CH1_CFG1_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_CH1_CFG1_REG" offset="244" width="32" description="">
		<bitfield id="PRU0_ED_RX_EN_COUNTER1" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TST_DELAY_COUNTER1" width="16" begin="15" end="0" resetval="0x0" description="" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_CH2_CFG0_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_CH2_CFG0_REG" offset="248" width="32" description="">
		<bitfield id="PRU0_ED_TX_FIFO_SWAP_BITS2" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_SW_CLK_OUT2" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_CLK_OUT_OVR_EN2" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_RX_SNOOP2" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/>
	<bitfield id="PRU0_ED_RX_FRAME_SIZE2" width="12" begin="27" end="16" resetval="0x0" description="" range="27:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_FRAME_SIZE2" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TX_WDLY2" width="11" begin="10" end="0" resetval="0x0" description="" range="10:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU0_ED_CH2_CFG1_REG" acronym="ICSSM_PR1_CFG_SLV_PRU0_ED_CH2_CFG1_REG" offset="252" width="32" description="">
		<bitfield id="PRU0_ED_RX_EN_COUNTER2" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU0_ED_TST_DELAY_COUNTER2" width="16" begin="15" end="0" resetval="0x0" description="" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_RX_CFG_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_RX_CFG_REG" offset="256" width="32" description="">
		<bitfield id="PRU1_ED_RX_DIV_FACTOR" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_DIV_FACTOR_FRAC" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_CLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_SB_POL" width="1" begin="3" end="3" resetval="0x1" description="" range="3" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_SAMPLE_SIZE" width="3" begin="2" end="0" resetval="0x7" description="" range="2:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_TX_CFG_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_TX_CFG_REG" offset="260" width="32" description="">
		<bitfield id="PRU1_ED_TX_DIV_FACTOR" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_DIV_FACTOR_FRAC" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/>
	<bitfield id="PRU1_ENDAT_SHARE_EN" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/>
	<bitfield id="PRU1_ENDAT2_CLK_SYNC" width="1" begin="10" end="10" resetval="0x1" description="" range="10" rwaccess="R"/>
	<bitfield id="PRU1_ENDAT1_CLK_SYNC" width="1" begin="9" end="9" resetval="0x1" description="" range="9" rwaccess="R"/>
	<bitfield id="PRU1_ENDAT0_CLK_SYNC" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R"/>
	<bitfield id="PRU1_ED_BUSY_2" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/>
	<bitfield id="PRU1_ED_BUSY_1" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/>
	<bitfield id="PRU1_ED_BUSY_0" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R"/>
	<bitfield id="PRU1_ED_TX_CLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_CH0_CFG0_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_CH0_CFG0_REG" offset="264" width="32" description="">
		<bitfield id="PRU1_ED_TX_FIFO_SWAP_BITS0" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_SW_CLK_OUT0" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_CLK_OUT_OVR_EN0" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_SNOOP0" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/>
	<bitfield id="PRU1_ED_RX_FRAME_SIZE0" width="12" begin="27" end="16" resetval="0x0" description="" range="27:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_FRAME_SIZE0" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_WDLY0" width="11" begin="10" end="0" resetval="0x0" description="" range="10:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_CH0_CFG1_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_CH0_CFG1_REG" offset="268" width="32" description="">
		<bitfield id="PRU1_ED_RX_EN_COUNTER0" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TST_DELAY_COUNTER0" width="16" begin="15" end="0" resetval="0x0" description="" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_CH1_CFG0_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_CH1_CFG0_REG" offset="272" width="32" description="">
		<bitfield id="PRU1_ED_TX_FIFO_SWAP_BITS1" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_SW_CLK_OUT1" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_CLK_OUT_OVR_EN1" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_SNOOP1" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/>
	<bitfield id="PRU1_ED_RX_FRAME_SIZE1" width="12" begin="27" end="16" resetval="0x0" description="" range="27:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_FRAME_SIZE1" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_WDLY1" width="11" begin="10" end="0" resetval="0x0" description="" range="10:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_CH1_CFG1_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_CH1_CFG1_REG" offset="276" width="32" description="">
		<bitfield id="PRU1_ED_RX_EN_COUNTER1" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TST_DELAY_COUNTER1" width="16" begin="15" end="0" resetval="0x0" description="" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_CH2_CFG0_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_CH2_CFG0_REG" offset="280" width="32" description="">
		<bitfield id="PRU1_ED_TX_FIFO_SWAP_BITS2" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_SW_CLK_OUT2" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_CLK_OUT_OVR_EN2" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_RX_SNOOP2" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/>
	<bitfield id="PRU1_ED_RX_FRAME_SIZE2" width="12" begin="27" end="16" resetval="0x0" description="" range="27:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_FRAME_SIZE2" width="5" begin="15" end="11" resetval="0x0" description="" range="15:11" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TX_WDLY2" width="11" begin="10" end="0" resetval="0x0" description="" range="10:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_PRU1_ED_CH2_CFG1_REG" acronym="ICSSM_PR1_CFG_SLV_PRU1_ED_CH2_CFG1_REG" offset="284" width="32" description="">
		<bitfield id="PRU1_ED_RX_EN_COUNTER2" width="16" begin="31" end="16" resetval="0x0" description="" range="31:16" rwaccess="R/W"/>
	<bitfield id="PRU1_ED_TST_DELAY_COUNTER2" width="16" begin="15" end="0" resetval="0x0" description="" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_CFG_SLV_RTU0_POKE_EN0_REG" acronym="ICSSM_PR1_CFG_SLV_RTU0_POKE_EN0_REG" offset="292" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_RTU1_POKE_EN0_REG" acronym="ICSSM_PR1_CFG_SLV_RTU1_POKE_EN0_REG" offset="300" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM0" acronym="ICSSM_PR1_CFG_SLV_PWM0" offset="304" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM1" acronym="ICSSM_PR1_CFG_SLV_PWM1" offset="308" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM2" acronym="ICSSM_PR1_CFG_SLV_PWM2" offset="312" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM3" acronym="ICSSM_PR1_CFG_SLV_PWM3" offset="316" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM0_0" acronym="ICSSM_PR1_CFG_SLV_PWM0_0" offset="320" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM0_1" acronym="ICSSM_PR1_CFG_SLV_PWM0_1" offset="324" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM0_2" acronym="ICSSM_PR1_CFG_SLV_PWM0_2" offset="328" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM1_0" acronym="ICSSM_PR1_CFG_SLV_PWM1_0" offset="332" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM1_1" acronym="ICSSM_PR1_CFG_SLV_PWM1_1" offset="336" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM1_2" acronym="ICSSM_PR1_CFG_SLV_PWM1_2" offset="340" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM2_0" acronym="ICSSM_PR1_CFG_SLV_PWM2_0" offset="344" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM2_1" acronym="ICSSM_PR1_CFG_SLV_PWM2_1" offset="348" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM2_2" acronym="ICSSM_PR1_CFG_SLV_PWM2_2" offset="352" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM3_0" acronym="ICSSM_PR1_CFG_SLV_PWM3_0" offset="356" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM3_1" acronym="ICSSM_PR1_CFG_SLV_PWM3_1" offset="360" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PWM3_2" acronym="ICSSM_PR1_CFG_SLV_PWM3_2" offset="364" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_SPIN_LOCK0" acronym="ICSSM_PR1_CFG_SLV_SPIN_LOCK0" offset="368" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_SPIN_LOCK1" acronym="ICSSM_PR1_CFG_SLV_SPIN_LOCK1" offset="372" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG0" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG0" offset="376" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT0" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT0" offset="380" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG1" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG1" offset="384" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT1" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT1" offset="388" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG2" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG2" offset="392" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT2" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT2" offset="396" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG3" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_CFG3" offset="400" width="32" description="">
		</register><register id="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT3" acronym="ICSSM_PR1_CFG_SLV_PA_STAT_PDSP_STAT3" offset="404" width="32" description="">
		</register>
</module>